---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.BuiltInFailures.ExtrusionFailures
source: html/4cfac887-8e74-4d6f-735d-e3c90aeb383a.htm
---
# BuiltInFailures.ExtrusionFailures Members

Provides a container of all Revit built-in FailureDefinitionId instances.